---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.BuiltInFailures.GeneralFailures
source: html/164d7211-7b6f-7a21-04f3-98bce4f10f85.htm
---
# BuiltInFailures.GeneralFailures Members

Provides a container of all Revit built-in FailureDefinitionId instances.